# Snaptravel - Case Study (Data Engineering Intern)

## Data Preprocessing

In [18]:
# Imports
import io
import re
import pandas as pd
import numpy as np

# Raw data
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21,\
40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways.\
);[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78,\
66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

In [19]:
# Convert to DataFrame
data = io.StringIO(data)
df = pd.read_csv(data, sep=';')
df

        Airline Code    DelayTimes  FlightCodes           To_From
0     Air Canada (!)       [21,40]      20015.0  WAterLoo_NEWYork
1  <Air France> (12)            []          NaN  Montreal_TORONTO
2  (Porter Airways.)  [60, 22, 87]      20035.0    CALgary_Ottawa
3     12. Air France       [78,66]          NaN  Ottawa_VANcouvER
4  ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

### Transformation 1

FlightCodes column: Some values are null. Flight Codes are supposed to increase by 10 with each row so 1010 and 1030 will have 1020 in the middle. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [20]:
df['FlightCodes'] = pd.to_numeric(df['FlightCodes']).interpolate().astype(int)
df

        Airline Code    DelayTimes  FlightCodes           To_From
0     Air Canada (!)       [21,40]        20015  WAterLoo_NEWYork
1  <Air France> (12)            []        20025  Montreal_TORONTO
2  (Porter Airways.)  [60, 22, 87]        20035    CALgary_Ottawa
3     12. Air France       [78,66]        20045  Ottawa_VANcouvER
4  ".\.Lufthansa.\."      [12, 33]        20055   london_MONTreal

### Transformation 2

ToFrom column: Should be split into two separate columns for better analysis! Split on '_' to create two new columns respectively. Also, the case of the column is not very readable, convert the column into capital case.

In [21]:
df[['To', 'From']] = df['To_From'].str.upper().str.split('_', expand=True)
df = df.drop(['To_From'], axis=1)
df

        Airline Code    DelayTimes  FlightCodes        To       From
0     Air Canada (!)       [21,40]        20015  WATERLOO    NEWYORK
1  <Air France> (12)            []        20025  MONTREAL    TORONTO
2  (Porter Airways.)  [60, 22, 87]        20035   CALGARY     OTTAWA
3     12. Air France       [78,66]        20045    OTTAWA  VANCOUVER
4  ".\.Lufthansa.\."      [12, 33]        20055    LONDON   MONTREAL

### Transformation 3
Airline Code column: Clean the Airline Codes to have no punctuation except spaces in the middle. E.g. '(Porter Airways. )' should become 'Porter Airways'.

In [22]:
df['Airline Code'] = df['Airline Code'].str.replace('[^\w\s]','')
df

     Airline Code    DelayTimes  FlightCodes        To       From
0     Air Canada        [21,40]        20015  WATERLOO    NEWYORK
1   Air France 12            []        20025  MONTREAL    TORONTO
2  Porter Airways  [60, 22, 87]        20035   CALGARY     OTTAWA
3   12 Air France       [78,66]        20045    OTTAWA  VANCOUVER
4       Lufthansa      [12, 33]        20055    LONDON   MONTREAL

### Mock SQL Query

Write a mock SQL query on the above table to find all flights leaving from Waterloo.

In [ ]:
SELECT * FROM df WHERE df.From = 'Waterloo'